БухЭксп/Catalogs/CW_ТипыСлежения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ТипыСлежения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОборудованияПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Статусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяДата</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборУстановлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ТипыСлежения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеОбъектовСлежения"));
	
	тОбъект 	= РеквизитФормыВЗначение("Объект");
	СхемаОтбора = тОбъект.ПолучитьМакет("МакетОтбораГрузоперевозок");
	АдресСхемы  = ПоместитьВоВременноеХранилище(СхемаОтбора,ЭтаФорма.УникальныйИдентификатор); 
	
	МассивПараметров = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСписокПараметровПоТипуЗначения(Тип("Дата"));
	АдресПараметров  = ПоместитьВоВременноеХранилище(МассивПараметров, Новый УникальныйИдентификатор);
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьДобавленныеКолонкиТаблицы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаСтатуса из Объект.Статусы Цикл
		Если ЭтоАдресВременногоХранилища(СтрокаСтатуса.АдресОтбора) Тогда
			ИндексСтроки    = Объект.Статусы.Индекс(СтрокаСтатуса); 
			НастройкиОтбора = ПолучитьИзВременногоХранилища(СтрокаСтатуса.АдресОтбора);
			
			СтрокаОбъекта 	= ТекущийОбъект.Статусы[ИндексСтроки];
			СтрокаОбъекта.ХранилищеОтбора = Новый ХранилищеЗначения(НастройкиОтбора);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СтатусыШаблонОписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблона",ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,Режим",Элемент.ТекстРедактирования,"СтатусыОборудования");
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаИзмененияШаблона(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Элементы.Статусы.ТекущиеДанные.ШаблонОписания = Ответ;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура СтатусыКонтрольнаяДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораКонтрольнойДаты",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВыбораПараметровПоТипамПеревозок",,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбораКонтрольнойДаты(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		
		Если (Элементы.Статусы.ТекущиеДанные.КонтрольнаяДата <> Ответ) Тогда
			
			Если (_ПроверитьИспользованиеКонтрольнойДаты(Ответ)) Тогда
				
				Элементы.Статусы.ТекущиеДанные.КонтрольнаяДата = Ответ;
				
			Иначе
				
				ПоказатьПредупреждение(,"Контрольная дата уже добавлена.");
				
			КонецЕсли; 
			
		Иначе
			
			Элементы.Статусы.ТекущиеДанные.КонтрольнаяДата = Ответ;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПроверитьИспользованиеКонтрольнойДаты(Ответ)
	// --- 
	
	Результат = Объект.Статусы.НайтиСтроки(Новый Структура("КонтрольнаяДата",Ответ));
	Возврат(Результат.Количество()=0);
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура СтатусыКонтрольнаяДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Результат = _ПроверитьИспользованиеКонтрольнойДаты(ВыбранноеЗначение);
	Если (НЕ Результат) Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,"Контрольная дата уже добавлена.");
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаПерезаполнитьПараметрыВедомых(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияПерезаписиПараметров",ЭтотОбъект, Новый Структура()); 
	ПоказатьВопрос(ПОВ,"Произвести перерасчёт статусов связанных грузоперевозок?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаПодтвержденияПерезаписиПараметров(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			Записать();
			_ПерезаполнитьПараметрыВедомых();
			Состояние("Пересчёт завершён.");
			
		КонецЕсли;  
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаСервере
Процедура _ПерезаполнитьПараметрыВедомых()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.ОтслеживаемоеОборудование.ВариантСлежения.ТипСлежения = &ТипСлежения";
	Запрос.УстановитьПараметр("ТипСлежения", Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		ГрузоперевозкаОбъект = Стр.Ссылка.ПолучитьОбъект();
		ГрузоперевозкаОбъект.Записать();
		
	КонецЦикла;
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура СтатусыКонтрольнаяДатаПриИзменении(Элемент)
	ЗаполнитьДобавленныеКолонкиТаблицы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьДобавленныеКолонкиТаблицы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблицы()  
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	
	Для Каждого СтрокаТаблицы из ТОбъект.Статусы Цикл     
		
		ИндексСтроки = ТОбъект.Статусы.Индекс(СтрокаТаблицы);  
		СтрокаОбъекта = Объект.Статусы[ИндексСтроки];
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.КонтрольнаяДата) Тогда
			СтрокаОбъекта.ИндексКартинки = ?(СтрокаТаблицы.КонтрольнаяДата.КонтрольнаяДатаИспользуетВремя, 1, 2);
		КонецЕсли; 

		НастройкиОтбора = СтрокаТаблицы.ХранилищеОтбора.Получить();
		АдерсОтбора		= ПоместитьВоВременноеХранилище(НастройкиОтбора, Новый УникальныйИдентификатор);
		СтрокаОбъекта.АдресОтбора =  АдерсОтбора;  
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыКонтрольнаяДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", Элементы.Статусы.ТекущиеДанные.КонтрольнаяДата);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыПараметра", ЭтотОбъект);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПараметра(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьДобавленныеКолонкиТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтаутсПоУмолчанию(Команда)  
	
	ТекущаяСтрока = Элементы.Статусы.ТекущаяСтрока;
	УстановитьСтаутсПоУмолчаниюНаСервере(ТекущаяСтрока);  
	
КонецПроцедуры

 &НаСервере
Процедура УстановитьСтаутсПоУмолчаниюНаСервере(ТекущаяСтрока)

	СтрокаТекущая = Объект.Статусы.НайтиПоИдентификатору(ТекущаяСтрока);
	Объект.СтатусОборудованияПоУмолчанию = СтрокаТекущая.Статус;

КонецПроцедуры

// ---------------------------------------------------------------------------- 
#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти  

&НаКлиенте
Процедура СтатусыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда   
		
		СтрокаТекущая 	= Объект.Статусы.НайтиПоИдентификатору(ВыбраннаяСтрока);
		АдресОтбора 	= СтрокаТекущая.АдресОтбора;  
		
		Если Не ЭтоАдресВременногоХранилища(АдресОтбора) Тогда
			АдресОтбора = ПолучитьПустойАдресОтбора();	
		КонецЕсли;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("АдресОтбора", АдресОтбора);   
		ПараметрыОткрытия.Вставить("АдресСхемы", АдресСхемы);   
		
		ДополнительныеПараметры = новый Структура;
		ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборНастроек", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("Справочник.CW_ТипыСлежения.Форма.ФормаРедактированияОтбора", ПараметрыОткрытия, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьПустойАдресОтбора()
	
	Возврат ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыборНастроек(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	ЗавершитьВыборНастроекНаСервере(РезультатВыбора, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыборНастроекНаСервере(РезультатВыбора, ДополнительныеПараметры) 
	
	Если НЕ ЭтоАдресВременногоХранилища(РезультатВыбора.АдресОтбора) Тогда
		Возврат;
	КонецЕсли;    
	
	СтрокаТекущая = Объект.Статусы.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);
	СтрокаТекущая.АдресОтбора 		= РезультатВыбора.АдресОтбора; 
	СтрокаТекущая.ОтборУстановлен 	= РезультатВыбора.ОтборУстановлен; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыКонтрольнаяДатаНачалоВыбора1(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;     
	
	МассивПараметров = ПолучитьИзВременногоХранилища(АдресПараметров);  
	Если ТипЗнч(МассивПараметров) <> Тип("Массив") Тогда
		МассивПараметров  = Новый Массив;
	КонецЕсли;

	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(МассивПараметров); 
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", СписокЗначений);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
